# Table of Contents

- [Customers.csv Cleaning](#customerscsv-cleaning)
- [Exchange_Rates.csv Cleaning](#exchange_ratescsv-cleaning)
- [Products.csv Cleaning](#productscsv-cleaning)
- [Sales.csv Cleaning](#salescsv-cleaning)
- [Stores.csv Cleaning](#storescsv-cleaning)

**Data Cleaning Tasks:**
* Convert to proper data types
* Remove redundant information
* Convert column names to be more manageable

# Customers.csv Cleaning

In [90]:
import pandas as pd
import numpy as np

In [91]:
customers = pd.read_csv('Raw Data/Customers.csv', encoding='latin1')

customers.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [92]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.2+ MB

10 entires are missing values for the state code column.

In [93]:
customers = customers.apply(
    lambda x: x.astype('string').str.strip() if x.dtype == 'object' else x
)

In [94]:
customers['Birthday'] = pd.to_datetime(customers['Birthday'])

In [95]:
customers = customers.drop(columns='State Code')  # Redundant column

In [96]:
customers.columns = customers.columns.map(
    lambda x: x.replace(' ', '_').lower().strip()
)

customers = customers.rename(columns={
    "customerkey": "customer_key", "birthday": "birthdate"
})

customers.columns

Index(['customer_key', 'gender', 'name', 'city', 'state', 'zip_code',
       'country', 'continent', 'birthdate'],
      dtype='object')

In [97]:
customers["city"] = customers["city"].str.title()

customers.head()

,customer_key,gender,name,city,state,zip_code,country,continent,birthdate
0,301,Female,Lilly Harding,Wandearah East,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,Mount Budd,Western Australia,6522,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,Winjallok,Victoria,3380,Australia,Australia,1947-05-26
3,786,Male,Jai Poltpalingada,Middle River,South Australia,5223,Australia,Australia,1957-09-17
4,1042,Male,Aidan Pankhurst,Tawonga South,Victoria,3698,Australia,Australia,1965-11-19

In [98]:
# Checking for duplicates on primary key
customers[customers.duplicated(subset='customer_key', keep=False)]

Empty DataFrame
Columns: [customer_key, gender, name, city, state, zip_code, country, continent, birthdate]
Index: []

In [99]:
customers.to_csv('Cleaned Data/customers_cleaned.csv', index=False)

# Exchange_Rates.csv Cleaning

In [100]:
exrates = pd.read_csv('Raw Data/Exchange_Rates.csv')

exrates.head()

       Date Currency  Exchange
0  1/1/2015      USD    1.0000
1  1/1/2015      CAD    1.1583
2  1/1/2015      AUD    1.2214
3  1/1/2015      EUR    0.8237
4  1/1/2015      GBP    0.6415

In [101]:
exrates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  object
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

In [102]:
exrates.columns = exrates.columns.map(
    lambda x:
        x+'_code' if x == 'Currency' else
        x+'_rate' if x == 'Exchange' else
        x
).str.lower()

exrates['date'] = pd.to_datetime(exrates['date'])

exrates['currency_code'] = exrates['currency_code'].astype('string')

In [103]:
exrates.dtypes

date             datetime64[ns]
currency_code    string[python]
exchange_rate           float64
dtype: object

In [104]:
exrates[exrates.duplicated(subset=['date','currency_code'], keep=False)]

Empty DataFrame
Columns: [date, currency_code, exchange_rate]
Index: []

In [105]:
exrates.to_csv('Cleaned Data/ExchangeRates_cleaned.csv', index=False)

# Products.csv Cleaning

In [106]:
products = pd.read_csv('Raw Data/Products.csv')

products.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio

In [107]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [108]:
products = products.apply(
    lambda x: x.astype('string').str.strip() if x.dtype == 'object' else x
)

In [109]:
columns = ['Unit Cost USD', 'Unit Price USD']

products[columns] = products[columns].replace(
    r'\$|,', '',  # Removing special characters from price data
    regex=True
).astype(float)

In [110]:
products.query('`Unit Cost USD` > 1000').head(1)  # Verifying changes

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
1896,1897,Fabrikam Refrigerator 24.7CuFt X9800 White,Fabrikam,White,1060.22,3199.99,802,Refrigerators,8,Home Appliances

In [111]:
products = products.rename(columns={
    'ProductKey': 'product_key',
    'Unit Cost USD': 'unit_cost',
    'Unit Price USD': 'unit_price',
    'SubcategoryKey': 'subcategory_key',
    'CategoryKey': 'category_key'
})

products.columns = products.columns.map(
    lambda x: x.replace(' ', '_').lower().strip()
)

products.columns

Index(['product_key', 'product_name', 'brand', 'color', 'unit_cost',
       'unit_price', 'subcategory_key', 'subcategory', 'category_key',
       'category'],
      dtype='object')

In [112]:
products['product_name'] = (
    products['product_name']
    .str.rsplit(' ', n=1)  # Removing color from product name
    .str[0]
    .str.strip()
    .astype('string')
)

products.head()

,product_key,product_name,brand,color,unit_cost,unit_price,subcategory_key,subcategory,category_key,category
0,1,Contoso 512MB MP3 Player E51,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio

In [113]:
products['subcategory'].unique()

<StringArray>
[                         'MP4&MP3',                    'Recording Pen',
             'Bluetooth Headphones',                      'Televisions',
                        'VCD & DVD',              'Home Theater System',
                        'Car Video',                          'Laptops',
                         'Desktops',                         'Monitors',
             'Projectors & Screens',         'Printers, Scanners & Fax',
            'Computers Accessories',                  'Digital Cameras',
              'Digital SLR Cameras',                       'Camcorders',
 'Cameras & Camcorders Accessories',             'Home & Office Phones',
              'Touch Screen Phones',              'Smart phones & PDAs',
                        'Movie DVD',                      'Boxed Games',
                   'Download Games',                 'Washers & Dryers',
                    'Refrigerators',                       'Microwaves',
                    'Water Heaters',                  'Coffee Machines',
                            'Lamps',                 'Air Conditioners',
                             'Fans',          'Cell phones Accessories']
Length: 32, dtype: string

In [114]:
products['subcategory'] = products['subcategory'].str.replace('MP4&', 'MP4 & ')

products['subcategory'] = products['subcategory'].str.replace(
    'Cell phones', 'Cell Phone'
)

products.query('product_key in [1,2512]')  # Verifying changes

,product_key,product_name,brand,color,unit_cost,unit_price,subcategory_key,subcategory,category_key,category
0,1,Contoso 512MB MP3 Player E51,Contoso,Silver,6.62,12.99,101,MP4 & MP3,1,Audio
2511,2512,Contoso Bluetooth Active Headphones L15,Contoso,Black,43.07,129.99,505,Cell Phone Accessories,5,Cell phones

In [115]:
products['category'].unique()

<StringArray>
[                        'Audio',                  'TV and Video',
                     'Computers',        'Cameras and camcorders',
                   'Cell phones', 'Music, Movies and Audio Books',
                'Games and Toys',               'Home Appliances']
Length: 8, dtype: string

In [116]:
products['category'] = products['category'].replace({
    'phones': 'Phones', 'cam': 'Cam'
})

In [117]:
products[products.duplicated(subset='product_key', keep=False)]

Empty DataFrame
Columns: [product_key, product_name, brand, color, unit_cost, unit_price, subcategory_key, subcategory, category_key, category]
Index: []

In [118]:
products.to_csv('Cleaned Data/products_cleaned.csv', index=False)

# Sales.csv Cleaning

In [119]:
sales = pd.read_csv('Raw Data/Sales.csv')

sales.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD

In [120]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   Delivery Date  13165 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: int64(6), object(3)
memory usage: 4.3+ MB

Missing values for the delivery date column can be attributed to non-digital purchases.

In [121]:
sales = sales.rename(columns={
    'CustomerKey': 'customer_key',
    'StoreKey': 'store_key',
    'ProductKey': 'product_key',
    'Currency Code': 'currency_code'
})

sales.columns = sales.columns.map(lambda x: x.replace(' ', '_').lower())

In [122]:
dates = sales.columns[2:4]

sales[dates] = sales[dates].apply(pd.to_datetime)

In [123]:
sales['currency_code'] = sales['currency_code'].astype('string')

In [124]:
# Checking if there are missing delivery date values for orders made online
sales.query('delivery_date.isna() and store_key == 0')

Empty DataFrame
Columns: [order_number, line_item, order_date, delivery_date, customer_key, store_key, product_key, quantity, currency_code]
Index: []

In [125]:
sales[sales.duplicated(subset=['order_number','line_item'], keep=False)]

Empty DataFrame
Columns: [order_number, line_item, order_date, delivery_date, customer_key, store_key, product_key, quantity, currency_code]
Index: []

In [126]:
sales.to_csv('Cleaned Data\sales_cleaned.csv', index=False)

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Ramzey\AppData\Local\Temp\ipykernel_47044\4135738131.py:1: SyntaxWarning: invalid escape sequence '\s'
  sales.to_csv('Cleaned Data\sales_cleaned.csv', index=False)

# Stores.csv Cleaning

In [127]:
stores = pd.read_csv('Raw Data/Stores.csv')

In [128]:
stores.head()

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

In [129]:
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [130]:
stores.columns = [
    'store_key', 'country', 'state', 'square_meters', 'open_date'
]

In [131]:
stores = stores.apply(
    lambda x: x.astype('string').str.strip() if x.dtype == 'object' else x
)

stores['open_date'] = pd.to_datetime(stores['open_date'], format='%m/%d/%Y')

In [132]:
stores.query('square_meters.isna()')

    store_key country   state  square_meters  open_date
66          0  Online  Online            NaN 2010-01-01

Missing sq. meters value belongs to the online store and can be ignored.

In [133]:
stores[stores.duplicated(subset='store_key', keep=False)]

Empty DataFrame
Columns: [store_key, country, state, square_meters, open_date]
Index: []

In [134]:
stores.to_csv('Cleaned Data/stores_cleaned.csv', index=False)